MCUdude/MiniCore/avr/boards.txt
#make atmega48p AVR_FREQ=8000000L BAUD_RATE=38400 LED=B5 LED_START_FLASHES=2
#make atmega48 AVR_FREQ=8000000L BAUD_RATE=38400 LED=B5 LED_START_FLASHES=2
#make atmega48p AVR_FREQ=8000000L BAUD_RATE=19200 LED=B5 LED_START_FLASHES=2
#make atmega48 AVR_FREQ=8000000L BAUD_RATE=19200 LED=B5 LED_START_FLASHES=2
48.menu.clock.8MHz_internal=8MHz internal  (BOD 2.7v)
48.menu.clock.8MHz_internal.upload.speed=38400
48.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
48.menu.clock.8MHz_internal.bootloader.extended_fuses=0xfc
48.menu.clock.8MHz_internal.bootloader.file=empty/empty.hex
48.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega48p AVR_FREQ=1000000L BAUD_RATE=9600 LED=B5 LED_START_FLASHES=2
#make atmega48 AVR_FREQ=1000000L BAUD_RATE=9600 LED=B5 LED_START_FLASHES=2
48.menu.clock.1MHz_internal=1MHz internal  (BOD 1.8v)
48.menu.clock.1MHz_internal.upload.speed=9600
48.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
48.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
48.menu.clock.1MHz_internal.bootloader.extended_fuses=0xfc
48.menu.clock.1MHz_internal.bootloader.file=empty/empty.hex
48.menu.clock.1MHz_internal.build.f_cpu=1000000L

############################################################


8.name=ATmega8
8.upload.tool=arduino:avrdude
8.upload.protocol=arduino
8.upload.maximum_size=7680
8.upload.maximum_data_size=1024

8.bootloader.tool=arduino:avrdude
8.bootloader.unlock_bits=0x3f
8.bootloader.lock_bits=0x0f

8.build.core=arduino:arduino
8.build.board=AVR_ATmega8
8.build.variant=standard
8.build.mcu=atmega8



#make atmega8 AVR_FREQ=16000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
8.menu.clock.16MHz_external=16MHz external (BOD 2.7v)
8.menu.clock.16MHz_external.upload.speed=115200
8.menu.clock.16MHz_external.bootloader.low_fuses=0xbf
8.menu.clock.16MHz_external.bootloader.high_fuses=0xd4
8.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_16MHz.hex
8.menu.clock.16MHz_external.build.f_cpu=16000000L

#make atmega8 AVR_FREQ=20000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
8.menu.clock.20MHz_external=20MHz external (BOD 4.0v)
8.menu.clock.20MHz_external.upload.speed=115200
8.menu.clock.20MHz_external.bootloader.low_fuses=0x3f
8.menu.clock.20MHz_external.bootloader.high_fuses=0xd4
8.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_20MHz.hex
8.menu.clock.20MHz_external.build.f_cpu=20000000L

#make atmega8 AVR_FREQ=12000000L BAUD_RATE=57600 LED=B5 LED_START_FLASHES=2
8.menu.clock.12MHz_external=12MHz external (BOD 2.7v)
8.menu.clock.12MHz_external.upload.speed=57600
8.menu.clock.12MHz_external.bootloader.low_fuses=0xbf
8.menu.clock.12MHz_external.bootloader.high_fuses=0xd4
8.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_12MHz.hex
8.menu.clock.12MHz_external.build.f_cpu=12000000L

#make atmega8 AVR_FREQ=8000000L BAUD_RATE=115200 LED=B5 LED_START_FLASHES=2
#make atmega8 AVR_FREQ=8000000L BAUD_RATE=57600 LED=B5 LED_START_FLASHES=2
8.menu.clock.8MHz_external=8MHz external  (BOD 2.7v)
8.menu.clock.8MHz_external.upload.speed=38400
8.menu.clock.8MHz_external.bootloader.low_fuses=0xbd
8.menu.clock.8MHz_external.bootloader.high_fuses=0xdd
8.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_8MHz.hex
8.menu.clock.8MHz_external.build.f_cpu=8000000L

#make atmega8 AVR_FREQ=8000000L BAUD_RATE=38400 LED=B5 LED_START_FLASHES=2
#make atmega8 AVR_FREQ=8000000L BAUD_RATE=19200 LED=B5 LED_START_FLASHES=2
8.menu.clock.8MHz_internal=8MHz internal  (BOD 2.7v)
8.menu.clock.8MHz_internal.upload.speed=38400
8.menu.clock.8MHz_internal.bootloader.low_fuses=0x94
8.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
8.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_8MHz.hex
8.menu.clock.8MHz_internal.build.f_cpu=8000000L

#make atmega8 AVR_FREQ=1000000L BAUD_RATE=9600 LED=B5 LED_START_FLASHES=2
8.menu.clock.1MHz_internal=1MHz internal  (BOD 2.7v)
8.menu.clock.1MHz_internal.upload.speed=9600
8.menu.clock.1MHz_internal.bootloader.low_fuses=0xa1
8.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
8.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.speed}_1MHz.hex
8.menu.clock.1MHz_internal.build.f_cpu=1000000L

############################################################